modify readme document
